In [ ]:
pip install sqlalchemy

In [ ]:
pip install pymysql

In [1]:
import sqlalchemy as db

# Connect to the database

In [2]:
engine = db.create_engine('mysql+pymysql://root:Rahul@112028@localhost/mydb')
connection = engine.connect()
metadata = db.MetaData()
employee = db.Table('employee', metadata, autoload=True, autoload_with=engine)

# Queries

Print columns names of employee table

In [3]:
print(employee.columns.keys())

['Emp_id', 'Name', 'Department', 'Basic_salary', 'HRA', 'DA']

Print metadata of employee table

In [4]:
print(repr(metadata.tables['employee']))

Table('employee', MetaData(bind=None), Column('Emp_id', INTEGER(), table=<employee>), Column('Name', VARCHAR(length=255), table=<employee>), Column('Department', VARCHAR(length=255), table=<employee>), Column('Basic_salary', INTEGER(), table=<employee>), Column('HRA', INTEGER(), table=<employee>), Column('DA', INTEGER(), table=<employee>), schema=None)

Select all records from employee table

In [6]:
query = db.select([employee]) 
Return = connection.execute(query)
Result = Return.fetchall()
Result[:]

[(10001, 'Riya', 'Sales', 7000, 200, 100),
 (10002, 'Apoorva', 'Accounts', 20000, 300, 200),
 (10003, 'Mohit', 'Marketing', 17000, 500, 300),
 (10004, 'Rita', 'Management', 25000, 400, 200),
 (10005, 'Ajay', 'Accounts', 15000, 350, 200),
 (10006, 'Riya', 'Marketing', 20000, 500, 400),
 (10007, 'Rahul', 'Management', 30000, 1000, 800),
 (10008, 'Apoorva', 'Sales', 10000, 400, 300),
 (10009, 'Kunal', 'Accounts', 18000, 500, 200),
 (10010, 'Mohit', 'Sales', 12000, 400, 150),
 (10011, 'Suraj', 'Marketing', 14000, 300, 150),
 (10012, 'John', 'Management', 23000, 700, 500),
 (10013, 'Rita', 'Sales', 10000, 300, 200),
 (10014, 'Apoorva', 'Sales', 12000, 400, 250),
 (10015, 'Ajay', 'Sales', 14000, 300, 800)]

Print the first record in the employee table

In [7]:
query = db.select([employee]) 
Return = connection.execute(query)
Result = Return.fetchone()
Result[:]

(10001, 'Riya', 'Sales', 7000, 200, 100)

Insert data into employee table

In [9]:
query = db.insert(employee).values(Emp_id=10016, Name='Naresh', Basic_salary=60000, HRA = 1000, DA = 500, Department = "Management") 
Result = connection.execute(query)
results = connection.execute(db.select([employee])).fetchall()
results[:]

[(10001, 'Riya', 'Sales', 7000, 200, 100),
 (10002, 'Apoorva', 'Accounts', 20000, 300, 200),
 (10003, 'Mohit', 'Marketing', 17000, 500, 300),
 (10004, 'Rita', 'Management', 25000, 400, 200),
 (10005, 'Ajay', 'Accounts', 15000, 350, 200),
 (10006, 'Riya', 'Marketing', 20000, 500, 400),
 (10007, 'Rahul', 'Management', 30000, 1000, 800),
 (10008, 'Apoorva', 'Sales', 10000, 400, 300),
 (10009, 'Kunal', 'Accounts', 18000, 500, 200),
 (10010, 'Mohit', 'Sales', 12000, 400, 150),
 (10011, 'Suraj', 'Marketing', 14000, 300, 150),
 (10012, 'John', 'Management', 23000, 700, 500),
 (10013, 'Rita', 'Sales', 10000, 300, 200),
 (10014, 'Apoorva', 'Sales', 12000, 400, 250),
 (10015, 'Ajay', 'Sales', 14000, 300, 800),
 (10016, 'Naresh', 'Management', 60000, 1000, 500)]

Select employees from management department using WHERE

In [10]:
query = db.select([employee]).where(employee.columns.Department == 'Management')
Return = connection.execute(query)
Result = Return.fetchall()
Result[:]

[(10004, 'Rita', 'Management', 25000, 400, 200),
 (10007, 'Rahul', 'Management', 30000, 1000, 800),
 (10012, 'John', 'Management', 23000, 700, 500),
 (10016, 'Naresh', 'Management', 60000, 1000, 500)]

Select all employees whose Total_salary(Basic_salary + HRA + DA) is less than 15000 using WHERE

In [11]:
query = db.select([employee.columns.Emp_id, employee.columns.Name, employee.columns.Department, (employee.columns.Basic_salary + employee.columns.HRA + employee.columns.DA).label("total salary")]).where((employee.columns.Basic_salary + employee.columns.HRA + employee.columns.DA) < 15000)
Return = connection.execute(query)
Result = Return.fetchall()
Result[:]

[(10001, 'Riya', 'Sales', 7300),
 (10008, 'Apoorva', 'Sales', 10700),
 (10010, 'Mohit', 'Sales', 12550),
 (10011, 'Suraj', 'Marketing', 14450),
 (10013, 'Rita', 'Sales', 10500),
 (10014, 'Apoorva', 'Sales', 12650)]

Select employees working in Accounts and Sales department using IN

In [12]:
query = db.select([employee]).where(employee.columns.Department.in_(['Accounts', 'Sales']))
Return = connection.execute(query)
Result = Return.fetchall()
Result[:]

[(10001, 'Riya', 'Sales', 7000, 200, 100),
 (10002, 'Apoorva', 'Accounts', 20000, 300, 200),
 (10005, 'Ajay', 'Accounts', 15000, 350, 200),
 (10008, 'Apoorva', 'Sales', 10000, 400, 300),
 (10009, 'Kunal', 'Accounts', 18000, 500, 200),
 (10010, 'Mohit', 'Sales', 12000, 400, 150),
 (10013, 'Rita', 'Sales', 10000, 300, 200),
 (10014, 'Apoorva', 'Sales', 12000, 400, 250),
 (10015, 'Ajay', 'Sales', 14000, 300, 800)]

Select employees in the Descending Order of their Total_salary(Basic_salary + HRA + DA) using ORDER BY

In [13]:
query = db.select([employee.columns.Emp_id, employee.columns.Name, employee.columns.Department, (employee.columns.Basic_salary + employee.columns.HRA + employee.columns.DA).label("total salary")]).order_by(db.desc((employee.columns.Basic_salary + employee.columns.HRA + employee.columns.DA)))
Return = connection.execute(query)
Result = Return.fetchall()
Result[:]

[(10016, 'Naresh', 'Management', 61500),
 (10007, 'Rahul', 'Management', 31800),
 (10004, 'Rita', 'Management', 25600),
 (10012, 'John', 'Management', 24200),
 (10006, 'Riya', 'Marketing', 20900),
 (10002, 'Apoorva', 'Accounts', 20500),
 (10009, 'Kunal', 'Accounts', 18700),
 (10003, 'Mohit', 'Marketing', 17800),
 (10005, 'Ajay', 'Accounts', 15550),
 (10015, 'Ajay', 'Sales', 15100),
 (10011, 'Suraj', 'Marketing', 14450),
 (10014, 'Apoorva', 'Sales', 12650),
 (10010, 'Mohit', 'Sales', 12550),
 (10008, 'Apoorva', 'Sales', 10700),
 (10013, 'Rita', 'Sales', 10500),
 (10001, 'Riya', 'Sales', 7300)]

Select distinct employee names

In [14]:
query = db.select([employee.columns.Name.distinct()])
Return = connection.execute(query)
Result = Return.fetchall()
Result[:]

[('Riya',),
 ('Apoorva',),
 ('Mohit',),
 ('Rita',),
 ('Ajay',),
 ('Rahul',),
 ('Kunal',),
 ('Suraj',),
 ('John',),
 ('Naresh',)]